org/9_Strings.org
#+STARTUP: showall

#+TITLE:     9. Strings
#+AUTHOR:    Paul Gribble
#+EMAIL:     paul@gribblelab.org
#+DATE:      Summer 2012
#+HTML_LINK_UP: http://www.gribblelab.org/CBootCamp/index.html
#+HTML_LINK_HOME: http://www.gribblelab.org/CBootCamp/index.html

-----

I'll be honest, C is slightly awkward for dealing with character
strings, especially compared to languages like Python.

* Declaring strings

Constant character strings are written inside double-quotation marks
(line 5 below).

Strings are actually, under the hood, arrays of characters. Single
character variables are declared using single-quotation marks (line 7
below).

String variables can be declared as indicated on line 8 below. The
double square brackets signify an array.

#+BEGIN_SRC c
#include <stdio.h>

int main(void) {

  printf("Hello world\n");

  char c = 'p';
  char s[] = "paul";

  printf("c=%c and s=%s\n", c, s);
  
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
Hello world
c=p and s=paul
#+END_EXAMPLE

** null-termination

An important thing to remember about strings is that they are always
*null-terminated*. This means that the last element of the character
array is a "null" character, abbreviated =\0=. When you declare a
string as in line 8 above, you don't have to put the null termination
character in yourself, the compiler does it for you. We can use the
=sizeof()= function to inspect our character string above to see how
long it actually is:

#+BEGIN_SRC c
#include <stdio.h>

int main(void) {

  char s[] = "paul";

  printf("s is %ld elements long\n", sizeof(s));
  
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
s is 5 elements long
#+END_EXAMPLE

So, to summarize, in C, strings are simply *null-terminated arrays of
characters*.

* Modifying strings

Importantly, once a string is declared to be a given length, you
cannot just make it longer or shorter by reassigning a new constant to
the variable. Well, you can sort of make it shorter, by writing a new
shorter string in the old string array, and terminating the new
(shorter) string with a null character. Then essentially you will have
a short string sitting in a long array, but that's ok, since we know
where the end is (the null termination character).

* String handling routines in the C standard library

The standard C library, (which you can load into your program by
including the statement =#include <string.h>= at the top of your
program), contains many useful routines for manipulating these
null-terminated strings.

I suggest you consult a reference source (or Wikipedia,
e.g. [[http://en.wikipedia.org/wiki/C_string_handling][C String Handling]]) for a list (it's relatively long) of all the
functions that exist for manipulating null-terminated strings in
C. There are functions for copying strings, concatenating strings,
getting the length of strings, comparing strings, etc.

** An example: Concatenating two strings

#+BEGIN_SRC C
#include <stdio.h>
#include <string.h>

int main(void) {

  char s1[] = "paul";
  char s2[] = "gribble";
  char s3[256];
  printf("s3=%s, strlen(s3)=%ld\n", s3, strlen(s3));

  strcat(s3, s1);
  printf("s3=%s, strlen(s3)=%ld\n", s3, strlen(s3));

  strcat(s3, " ");  
  printf("s3=%s, strlen(s3)=%ld\n", s3, strlen(s3));

  strcat(s3, s2);
  printf("s3=%s, strlen(s3)=%ld\n", s3, strlen(s3));

  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
s3=, strlen(s3)=0
s3=paul, strlen(s3)=4
s3=paul , strlen(s3)=5
s3=paul gribble, strlen(s3)=12
#+END_EXAMPLE

** Comparing two strings

Importantly, you cannot simply use the ~==~ operator to test whether
two strings are equal. Remember, strings are arrays of characters. You
have to use a special string handling function to test equality of two
strings, since it has to do a "deep" comparison, comparing each
element against each other. Here's how you would do it:

#+BEGIN_SRC C
#include <stdio.h>
#include <string.h>

int main(void) {

  char s1[] = "paul";
  char s2[] = "paul";
  char s3[] = "peter";
  char s4[] = "dave";

  printf("strcmp(s1,s2)? %d\n", strcmp(s1,s2));
  printf("strcmp(s1,s3)? %d\n", strcmp(s1,s3));
  printf("strcmp(s1,s4)? %d\n", strcmp(s1,s4));

  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
strcmp(s1,s2)? 0
strcmp(s1,s3)? -4
strcmp(s1,s4)? 12
#+END_EXAMPLE

Note that the =strcmp(s1,s2)= function returns =0= if =s1= and =s2=
are equal, a positive value if =s1= is (lexicographically) less than
=s2=, and a negative value if =s1= is greater than =s2=.

** Converting strings to and from numeric types

*** Strings to numbers

There are several functions to convert strings to numeric types like
integers and floating-point numbers. You will need to =#include
<stdlib.h>= at the top of your program.

- =double atof(s)= converts the string pointed to by =s= into a
  floating-point number (a double), returning the result
- =int atoi(s)= converts string =s= into an integer

There are a host of others, again I suggest consulting a reference
source for a comprehensive list.

