html/9_Strings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-28 Mon 21:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>9. Strings</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Paul Gribble" />
<link rel="stylesheet" type="text/css" href="mystyle.css" /></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://www.gribblelab.org/CBootCamp/index.html"> UP </a>
 |
 <a accesskey="H" href="http://www.gribblelab.org/CBootCamp/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">9. Strings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf9a9d81">Declaring strings</a>
<ul>
<li><a href="#orga4aede6">null-termination</a></li>
</ul>
</li>
<li><a href="#org22c8f25">Modifying strings</a></li>
<li><a href="#orgfca9d3f">String handling routines in the C standard library</a>
<ul>
<li><a href="#org0b29580">An example: Concatenating two strings</a></li>
<li><a href="#org9d6e78a">Comparing two strings</a></li>
<li><a href="#org3b21033">Converting strings to and from numeric types</a>
<ul>
<li><a href="#orgc5c7b29">Strings to numbers</a></li>
<li><a href="#org5d24256">Numbers to strings</a></li>
<li><a href="#org41ec5da">Numbers to string II (slightly esoteric)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8eade2f">Arrays of Strings</a></li>
<li><a href="#orgeeeda63">Links</a></li>
<li><a href="#org1179dbd">Exercises</a>
<ul>
<li><a href="#orgbc5a360">Solutions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<p>
I'll be honest, C is slightly awkward for dealing with character
strings, especially compared to languages like Python.
</p>

<div id="outline-container-orgf9a9d81" class="outline-2">
<h2 id="orgf9a9d81">Declaring strings</h2>
<div class="outline-text-2" id="text-orgf9a9d81">
<p>
Constant character strings are written inside double-quotation marks
(line 5 below).
</p>

<p>
Strings are actually, under the hood, arrays of characters. Single
character variables are declared using single-quotation marks (line 7
below).
</p>

<p>
String variables can be declared as indicated on line 8 below. The
double square brackets signify an array.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  printf(<span style="color: #8b2252;">"Hello world\n"</span>);

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">c</span> = <span style="color: #8b2252;">'p'</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s</span>[] = <span style="color: #8b2252;">"paul"</span>;

  printf(<span style="color: #8b2252;">"c=%c and s=%s\n"</span>, c, s);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
Hello world
c=p and s=paul
</pre>
</div>

<div id="outline-container-orga4aede6" class="outline-3">
<h3 id="orga4aede6">null-termination</h3>
<div class="outline-text-3" id="text-orga4aede6">
<p>
An important thing to remember about strings is that they are always
<b>null-terminated</b>. This means that the last element of the character
array is a "null" character, abbreviated <code>\0</code>. When you declare a
string as in line 8 above, you don't have to put the null termination
character in yourself, the compiler does it for you. We can use the
<code>sizeof()</code> function to inspect our character string above to see how
long it actually is:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s</span>[] = <span style="color: #8b2252;">"paul"</span>;

  printf(<span style="color: #8b2252;">"s is %ld elements long\n"</span>, <span style="color: #a020f0;">sizeof</span>(s));

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
s is 5 elements long
</pre>

<p>
So, to summarize, in C, strings are simply <b>null-terminated arrays of
characters</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-org22c8f25" class="outline-2">
<h2 id="org22c8f25">Modifying strings</h2>
<div class="outline-text-2" id="text-org22c8f25">
<p>
Importantly, once a string is declared to be a given length, you
cannot just make it longer or shorter by reassigning a new constant to
the variable. Well, you can sort of make it shorter, by writing a new
shorter string in the old string array, and terminating the new
(shorter) string with a null character. Then essentially you will have
a short string sitting in a long array, but that's ok, since we know
where the end is (the null termination character).
</p>
</div>
</div>

<div id="outline-container-orgfca9d3f" class="outline-2">
<h2 id="orgfca9d3f">String handling routines in the C standard library</h2>
<div class="outline-text-2" id="text-orgfca9d3f">
<p>
The standard C library, (which you can load into your program by
including the statement <code>#include &lt;string.h&gt;</code> at the top of your
program), contains many useful routines for manipulating these
null-terminated strings.
</p>

<p>
I suggest you consult a reference source (or Wikipedia,
e.g. <a href="http://en.wikipedia.org/wiki/C_string_handling">C String Handling</a>) for a list (it's relatively long) of all the
functions that exist for manipulating null-terminated strings in
C. There are functions for copying strings, concatenating strings,
getting the length of strings, comparing strings, etc.
</p>
</div>

<div id="outline-container-org0b29580" class="outline-3">
<h3 id="org0b29580">An example: Concatenating two strings</h3>
<div class="outline-text-3" id="text-org0b29580">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s1</span>[] = <span style="color: #8b2252;">"paul"</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s2</span>[] = <span style="color: #8b2252;">"gribble"</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s3</span>[256];
  printf(<span style="color: #8b2252;">"s3=%s, strlen(s3)=%ld\n"</span>, s3, strlen(s3));

  strcat(s3, s1);
  printf(<span style="color: #8b2252;">"s3=%s, strlen(s3)=%ld\n"</span>, s3, strlen(s3));

  strcat(s3, <span style="color: #8b2252;">" "</span>);  
  printf(<span style="color: #8b2252;">"s3=%s, strlen(s3)=%ld\n"</span>, s3, strlen(s3));

  strcat(s3, s2);
  printf(<span style="color: #8b2252;">"s3=%s, strlen(s3)=%ld\n"</span>, s3, strlen(s3));

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
s3=, strlen(s3)=0
s3=paul, strlen(s3)=4
s3=paul , strlen(s3)=5
s3=paul gribble, strlen(s3)=12
</pre>
</div>
</div>

<div id="outline-container-org9d6e78a" class="outline-3">
<h3 id="org9d6e78a">Comparing two strings</h3>
<div class="outline-text-3" id="text-org9d6e78a">
<p>
Importantly, you cannot simply use the <code>==</code> operator to test whether
two strings are equal. Remember, strings are arrays of characters. You
have to use a special string handling function to test equality of two
strings, since it has to do a "deep" comparison, comparing each
element against each other. Here's how you would do it:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s1</span>[] = <span style="color: #8b2252;">"paul"</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s2</span>[] = <span style="color: #8b2252;">"paul"</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s3</span>[] = <span style="color: #8b2252;">"peter"</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s4</span>[] = <span style="color: #8b2252;">"dave"</span>;

  printf(<span style="color: #8b2252;">"strcmp(s1,s2)? %d\n"</span>, strcmp(s1,s2));
  printf(<span style="color: #8b2252;">"strcmp(s1,s3)? %d\n"</span>, strcmp(s1,s3));
  printf(<span style="color: #8b2252;">"strcmp(s1,s4)? %d\n"</span>, strcmp(s1,s4));

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
strcmp(s1,s2)? 0
strcmp(s1,s3)? -4
strcmp(s1,s4)? 12
</pre>

<p>
Note that the <code>strcmp(s1,s2)</code> function returns <code>0</code> if <code>s1</code> and <code>s2</code>
are equal, a positive value if <code>s1</code> is (lexicographically) less than
<code>s2</code>, and a negative value if <code>s1</code> is greater than <code>s2</code>.
</p>
</div>
</div>

<div id="outline-container-org3b21033" class="outline-3">
<h3 id="org3b21033">Converting strings to and from numeric types</h3>
<div class="outline-text-3" id="text-org3b21033">
</div>
<div id="outline-container-orgc5c7b29" class="outline-4">
<h4 id="orgc5c7b29">Strings to numbers</h4>
<div class="outline-text-4" id="text-orgc5c7b29">
<p>
There are several functions to convert strings to numeric types like
integers and floating-point numbers. You will need to <code>#include
&lt;stdlib.h&gt;</code> at the top of your program.
</p>

<ul class="org-ul">
<li><code>double atof(s)</code> converts the string pointed to by <code>s</code> into a
floating-point number (a double), returning the result</li>
<li><code>int atoi(s)</code> converts string <code>s</code> into an integer</li>
</ul>

<p>
There are a host of others, again I suggest consulting a reference
source for a comprehensive list.
</p>
</div>
</div>
