html/9_Strings.html

<div id="outline-container-org5d24256" class="outline-4">
<h4 id="org5d24256">Numbers to strings</h4>
<div class="outline-text-4" id="text-org5d24256">
<p>
The common way of converting a numeric type like an integer or a
floating-point number into a string, is to use the <code>sprintf()</code>
function. It it used much like the <code>printf()</code> function we have seen
before, but instead of printing something to the screen, <code>sprintf()</code>
"prints" something to a character string. Here's how to use it:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s1</span>[256];
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">s2</span>[256];
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i1</span> = 12;
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">d1</span> = 3.141;

  sprintf(s1, <span style="color: #8b2252;">"%d"</span>, i1);
  sprintf(s2, <span style="color: #8b2252;">"%.3f"</span>, d1);

  printf(<span style="color: #8b2252;">"s1 = %s\n"</span>, s1);
  printf(<span style="color: #8b2252;">"s2 = %s\n"</span>, s2);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
s1 = 12
s2 = 3.141
</pre>

<p>
Note how on lines 6 and 7 when <code>s1</code> and <code>s2</code> are declared, I declare
them as character arrays large enough to hold 256 characters. If you
try to <code>sprintf()</code> to a string that is not big enough to hold what
you're trying to put into it, then you will end up writing values
beyond the end of the string, and onto who knows what, in memory. If
you are dealing with strings that you know will be relatively short
(things like filenames, subject names, dates, etc) then probably the
easiest way of doing things is to use preallocated strings that are
long enough to hold any reasonable value (e.g. 256 characters
long). After all we have enough RAM in our computers these days not to
have to worry too much about 256 bytes here and there.
</p>
</div>
</div>

<div id="outline-container-org41ec5da" class="outline-4">
<h4 id="org41ec5da">Numbers to string II (slightly esoteric)</h4>
<div class="outline-text-4" id="text-org41ec5da">
<p>
There is, however, a way to do this without having to hard-code the
size of the string to be written to, although it's a little bit
roundabout. However it does illustrate several principles of C so
let's have a look at it.
</p>

<p>
First we will use the <code>snprintf()</code> function in a roundabout way to
determine the number of bytes that the numeric to string conversion
will result in. Then we will use <code>malloc()</code> to allocate a new string
(character array) of that length. Finally we will use <code>sprintf()</code> to
write to that character array. The first step ensures that we have a
character array (a string) that is just the right length to recieve
the converted numeric: not too small, and not too big.
</p>

<p>
Here is some sample code that demonstrates this, first for an integer
conversion, and then for a floating-point conversion:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">size</span>;

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span> = 8765309;
  size = snprintf(<span style="color: #008b8b;">NULL</span>, 0, <span style="color: #8b2252;">"%d"</span>, x);
  <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">xc</span> = malloc(size + 1);
  sprintf(xc, <span style="color: #8b2252;">"%d"</span>, x);

  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">y</span> = 876.5309;
  size = snprintf(<span style="color: #008b8b;">NULL</span>, 0, <span style="color: #8b2252;">"%.4f"</span>, y);
  <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">yc</span> = malloc(size + 1);
  sprintf(yc, <span style="color: #8b2252;">"%.4f"</span>, y);

  printf(<span style="color: #8b2252;">"xc = %s\n"</span>, xc);
  printf(<span style="color: #8b2252;">"yc = %s\n"</span>, yc);

  free(xc);
  free(yc);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
xc = 8765309
yc = 876.5309
</pre>

<p>
Note on lines 10 and 15, where we use <code>snprintf()</code>, we are passing
<code>NULL</code> as the first argument. The <code>snprintf()</code> function is like
<code>sprintf()</code>, but it takes as its second argument, the maximum number
of bytes to write out to the destination string. Thus <code>snprintf()</code> can
be thought of as a "safe" version of <code>sprintf()</code> in that you <b>know</b>
for sure that you will never write out more than the maximum number of
bytes you ask for. Thus you can avoid over-writing past the end of
your destination string buffer. The <code>snprintf()</code> function will return
as its return value, the number of bytes <b>that would have been
written</b> had the second argument been sufficiently large (not counting
the termination <code>\0</code> character).
</p>

<p>
So here we are passing <code>NULL</code> as the first argument, and <code>0</code> as the
second. So as a result, <code>snprintf()</code> won't actually write any
characters anywhere, it will simply return the number of characters
that would have been written. Then on lines 11 and 16, we can use
<code>malloc()</code> to dynamically allocate character arrays of exactly the
required length.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org8eade2f" class="outline-2">
<h2 id="org8eade2f">Arrays of Strings</h2>
<div class="outline-text-2" id="text-org8eade2f">
<p>
We have seen that strings are just arrays of characters, terminated by
a null character. We have also seen that the variables that hold
strings (like arrays of other types, e.g. <code>int</code> or <code>double</code>, are
actually <b>pointers</b> to the head of the array. We can use an array of
pointers, where each pointer is a pointer to the head of a character
array (in other words a string), to store an array of strings. Here is
an example:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
  <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">provinces</span>[] = { <span style="color: #8b2252;">"British Columbia"</span>, <span style="color: #8b2252;">"Alberta"</span>, <span style="color: #8b2252;">"Saskatchewan"</span>, 
                        <span style="color: #8b2252;">"Manitoba"</span>, <span style="color: #8b2252;">"Ontario"</span>, <span style="color: #8b2252;">"Quebec"</span>, <span style="color: #8b2252;">"New Brunswick"</span>,
                        <span style="color: #8b2252;">"Nova Scotia"</span>, <span style="color: #8b2252;">"Prince Edward Island"</span>, <span style="color: #8b2252;">"Newfoundland"</span>,
                        <span style="color: #8b2252;">"Yukon"</span>, <span style="color: #8b2252;">"Northwest Territories"</span>, <span style="color: #8b2252;">"Nunavut"</span> };
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=0; i&lt;13; i++) {
    printf(<span style="color: #8b2252;">"provinces[%d] = %s\n"</span>, i, provinces[i]);
  }
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
provinces[0] = British Columbia
provinces[1] = Alberta
provinces[2] = Saskatchewan
provinces[3] = Manitoba
provinces[4] = Ontario
provinces[5] = Quebec
provinces[6] = New Brunswick
provinces[7] = Nova Scotia
provinces[8] = Prince Edward Island
provinces[9] = Newfoundland
provinces[10] = Yukon
provinces[11] = Northwest Territories
provinces[12] = Nunavut
</pre>
</div>
</div>


<div id="outline-container-orgeeeda63" class="outline-2">
<h2 id="orgeeeda63">Links</h2>
<div class="outline-text-2" id="text-orgeeeda63">
<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/C_string_handling">Wikipedia: C string handling</a></li>
</ul>
</div>
</div>
